{
    "en" : {
        "error400_1" : "Unable to access user attributes.",
        "error10917" : "Internal server error -10917. Unable to update account settings. Please report this error to administrator.",
        "error401_1" : "Client software is unauthorized.",
        "error10909" : "Unable to login with Google account: Internal server error -10909. Please report this error to administrator.",
        "error10910" : "Unable to login with Google account: Internal server error -10910. Please report this error to administrator.",
        "error406_1" : "Unable to login with Google account: invalid token.",
        "error10911" : "Unable to login with Facebook account: Internal server error -10911. Please report this error to administrator.",
        "error10912" : "Unable to login with Facebook account: Internal server error -10912. Please report this error to administrator.",
        "error406_2" : "Unable to login with Facebook account: invalid token.",
        "error10916" : "Internal server error -10916. User not found. Please report this error to administrator.",
        "error440_1" : "Server Error code -9002. The session has expired. Please re-login.",
        "error406_3" : "Server Error code -9003. The session is invalid. Please re-login.",
        "error404_1" : "Recipient's account exists but has no devices associated with it. Please contact the recipient.",
        "error10915" : "Internal server error -10915. Please report this error to administrator.",
        "error400_2" : "Invalid request parameters.",
        "error400_3" : "Account with this email address already exists.",
        "error10918" : "Internal server error -10918. Unable to create user account. Please report this error to administrator.",
        "error10919" : "Internal server error -10919. Unable to delete user account. Please report this error to administrator.",
        "error403_1" : "This Shaker client has been disabled or cannot be activated.",
        "error426_1" : "Shaker client software upgrade is required.",
        "error205_1" : "This Shaker client has been already registered.",
        "error10907" : "Internal server error -10907. Please report this error to administrator.",
        "error404_2" : "Internal server error: Shaker Client not found. Please report this error to administrator.",
        "error10921" : "Internal server error -10921. Invalid user id. Please report this error to administrator.",
        "error10922" : "Internal server error -10922. Invalid device id. Please report this error to administrator.",
        "error10908" : "Internal server error -10908. Please report this error to administrator.",
        "error400_4" : "Invalid account activation request.",
        "error10920" : "Internal server error -10920. Unable to update account settings; please report this error to administrator.",
        "error400_5" : "This device token is not registered. You may need to reinstall the app.",
        "error400_6" : "Your account is not authorized or has been disabled.",
        "error413_1" : "Teleportation limit has been reached. Would you like to upgrade your account?",
        "error414_1" : "Your subscription has expired. Would you like to renew your subscription?",
        "error10902" : "No active devices associated with the user account. Server error code -10902.",
        "error10904" : "Internal server error -10904. Please report this error to administrator.",
        "error10901" : "Internal server error -10901. Please report this error to administrator.",
        "error10903" : "Internal server error -10903. Please report this error to administrator.",
        "error410_1" : "Recipient does not have a Shaker account.",
        "error411_1" : "Recipient's account is has been disabled.",
        "error427_1" : "Invalid upgrade code.",
        "error429_1" : "A new device cannot be added because the device limit for this account has been reached. Delete one or more devices from your account to add a new one.",
        "error421_1" : "File upload request no longer valid",
        "error11000" : "Server error code -11000: connection request no longer valid.",
        "error11001" : "Internal server error code -11001: cannot create connection request. Please try again later.",
        "error11002" : "Invalid activation pin.",

        "registered"     : "The Shaker client has been successfully activated. You can start using Shaker now.",
        "activation"     : "Shaker client activation is required. Please follow instructions in the activation email.",
        "success_login"  : "Login successful.",
        "new_user"       : "New account has been successfully created.",
        "new_user_email" : "An activation email has been sent to your email account. Please activate your account before you login.",
        "success"        : "Success.",

        "upload_msg"     : "File upload request has been accepted. Please activate app to send file.",
        "retry_msg"      : "Previous upload request failed; please activate app to retry.",
        "request_msg"    : "Received file upload request from ",

        "chat_msg"       : "Chat request has been accepted. Please activate Shaker.",
        "request_chat"   : "Chat request from ",
        "retry_chat"     : "Previous chat request failed; please activate app to retry.",
        "error421_2"     : "Chat request no longer valid",

        "error_email_private" : "Login failed: private email cannot be used.",
        "error_email"    : "Login failed: email address is not verified."
    }
}